GopalSaraf/Practicals/PSDL/include/proc/pic18lf1230.inc
// Register: PTPERL
#define PTPERL PTPERL
PTPERL                                   equ 0F96h
// bitfield definitions
PTPERL_PTPERL_POSN                       equ 0000h
PTPERL_PTPERL_POSITION                   equ 0000h
PTPERL_PTPERL_SIZE                       equ 0008h
PTPERL_PTPERL_LENGTH                     equ 0008h
PTPERL_PTPERL_MASK                       equ 00FFh

// Register: PTMRH
#define PTMRH PTMRH
PTMRH                                    equ 0F97h
// bitfield definitions
PTMRH_PTMRH_POSN                         equ 0000h
PTMRH_PTMRH_POSITION                     equ 0000h
PTMRH_PTMRH_SIZE                         equ 0004h
PTMRH_PTMRH_LENGTH                       equ 0004h
PTMRH_PTMRH_MASK                         equ 000Fh

// Register: PTMRL
#define PTMRL PTMRL
PTMRL                                    equ 0F98h
// bitfield definitions
PTMRL_PTMRL_POSN                         equ 0000h
PTMRL_PTMRL_POSITION                     equ 0000h
PTMRL_PTMRL_SIZE                         equ 0008h
PTMRL_PTMRL_LENGTH                       equ 0008h
PTMRL_PTMRL_MASK                         equ 00FFh

// Register: PTCON1
#define PTCON1 PTCON1
PTCON1                                   equ 0F99h
// bitfield definitions
PTCON1_PTDIR_POSN                        equ 0006h
PTCON1_PTDIR_POSITION                    equ 0006h
PTCON1_PTDIR_SIZE                        equ 0001h
PTCON1_PTDIR_LENGTH                      equ 0001h
PTCON1_PTDIR_MASK                        equ 0040h
PTCON1_PTEN_POSN                         equ 0007h
PTCON1_PTEN_POSITION                     equ 0007h
PTCON1_PTEN_SIZE                         equ 0001h
PTCON1_PTEN_LENGTH                       equ 0001h
PTCON1_PTEN_MASK                         equ 0080h

// Register: PTCON0
#define PTCON0 PTCON0
PTCON0                                   equ 0F9Ah
// bitfield definitions
PTCON0_PTMOD_POSN                        equ 0000h
PTCON0_PTMOD_POSITION                    equ 0000h
PTCON0_PTMOD_SIZE                        equ 0002h
PTCON0_PTMOD_LENGTH                      equ 0002h
PTCON0_PTMOD_MASK                        equ 0003h
PTCON0_PTCKPS_POSN                       equ 0002h
PTCON0_PTCKPS_POSITION                   equ 0002h
PTCON0_PTCKPS_SIZE                       equ 0002h
PTCON0_PTCKPS_LENGTH                     equ 0002h
PTCON0_PTCKPS_MASK                       equ 000Ch
PTCON0_PTOPS_POSN                        equ 0004h
PTCON0_PTOPS_POSITION                    equ 0004h
PTCON0_PTOPS_SIZE                        equ 0004h
PTCON0_PTOPS_LENGTH                      equ 0004h
PTCON0_PTOPS_MASK                        equ 00F0h
PTCON0_PTMOD0_POSN                       equ 0000h
PTCON0_PTMOD0_POSITION                   equ 0000h
PTCON0_PTMOD0_SIZE                       equ 0001h
PTCON0_PTMOD0_LENGTH                     equ 0001h
PTCON0_PTMOD0_MASK                       equ 0001h
PTCON0_PTMOD1_POSN                       equ 0001h
PTCON0_PTMOD1_POSITION                   equ 0001h
PTCON0_PTMOD1_SIZE                       equ 0001h
PTCON0_PTMOD1_LENGTH                     equ 0001h
PTCON0_PTMOD1_MASK                       equ 0002h
PTCON0_PTCKPS0_POSN                      equ 0002h
PTCON0_PTCKPS0_POSITION                  equ 0002h
PTCON0_PTCKPS0_SIZE                      equ 0001h
PTCON0_PTCKPS0_LENGTH                    equ 0001h
PTCON0_PTCKPS0_MASK                      equ 0004h
PTCON0_PTCKPS1_POSN                      equ 0003h
PTCON0_PTCKPS1_POSITION                  equ 0003h
PTCON0_PTCKPS1_SIZE                      equ 0001h
PTCON0_PTCKPS1_LENGTH                    equ 0001h
PTCON0_PTCKPS1_MASK                      equ 0008h
PTCON0_PTOPS0_POSN                       equ 0004h
PTCON0_PTOPS0_POSITION                   equ 0004h
PTCON0_PTOPS0_SIZE                       equ 0001h
PTCON0_PTOPS0_LENGTH                     equ 0001h
PTCON0_PTOPS0_MASK                       equ 0010h
PTCON0_PTOPS1_POSN                       equ 0005h
PTCON0_PTOPS1_POSITION                   equ 0005h
PTCON0_PTOPS1_SIZE                       equ 0001h
PTCON0_PTOPS1_LENGTH                     equ 0001h
PTCON0_PTOPS1_MASK                       equ 0020h
PTCON0_PTOPS2_POSN                       equ 0006h
PTCON0_PTOPS2_POSITION                   equ 0006h
PTCON0_PTOPS2_SIZE                       equ 0001h
PTCON0_PTOPS2_LENGTH                     equ 0001h
PTCON0_PTOPS2_MASK                       equ 0040h
PTCON0_PTOPS3_POSN                       equ 0007h
PTCON0_PTOPS3_POSITION                   equ 0007h
PTCON0_PTOPS3_SIZE                       equ 0001h
PTCON0_PTOPS3_LENGTH                     equ 0001h
PTCON0_PTOPS3_MASK                       equ 0080h

// Register: OSCTUNE
#define OSCTUNE OSCTUNE
OSCTUNE                                  equ 0F9Bh
// bitfield definitions
OSCTUNE_TUN_POSN                         equ 0000h
OSCTUNE_TUN_POSITION                     equ 0000h
OSCTUNE_TUN_SIZE                         equ 0005h
OSCTUNE_TUN_LENGTH                       equ 0005h
OSCTUNE_TUN_MASK                         equ 001Fh
OSCTUNE_PLLEN_POSN                       equ 0006h
OSCTUNE_PLLEN_POSITION                   equ 0006h
OSCTUNE_PLLEN_SIZE                       equ 0001h
OSCTUNE_PLLEN_LENGTH                     equ 0001h
OSCTUNE_PLLEN_MASK                       equ 0040h
OSCTUNE_INTSRC_POSN                      equ 0007h
OSCTUNE_INTSRC_POSITION                  equ 0007h
OSCTUNE_INTSRC_SIZE                      equ 0001h
OSCTUNE_INTSRC_LENGTH                    equ 0001h
OSCTUNE_INTSRC_MASK                      equ 0080h
OSCTUNE_TUN0_POSN                        equ 0000h
OSCTUNE_TUN0_POSITION                    equ 0000h
OSCTUNE_TUN0_SIZE                        equ 0001h
OSCTUNE_TUN0_LENGTH                      equ 0001h
OSCTUNE_TUN0_MASK                        equ 0001h
OSCTUNE_TUN1_POSN                        equ 0001h
OSCTUNE_TUN1_POSITION                    equ 0001h
OSCTUNE_TUN1_SIZE                        equ 0001h
OSCTUNE_TUN1_LENGTH                      equ 0001h
OSCTUNE_TUN1_MASK                        equ 0002h
OSCTUNE_TUN2_POSN                        equ 0002h
OSCTUNE_TUN2_POSITION                    equ 0002h
OSCTUNE_TUN2_SIZE                        equ 0001h
OSCTUNE_TUN2_LENGTH                      equ 0001h
OSCTUNE_TUN2_MASK                        equ 0004h
OSCTUNE_TUN3_POSN                        equ 0003h
OSCTUNE_TUN3_POSITION                    equ 0003h
OSCTUNE_TUN3_SIZE                        equ 0001h
OSCTUNE_TUN3_LENGTH                      equ 0001h
OSCTUNE_TUN3_MASK                        equ 0008h
OSCTUNE_TUN4_POSN                        equ 0004h
OSCTUNE_TUN4_POSITION                    equ 0004h
OSCTUNE_TUN4_SIZE                        equ 0001h
OSCTUNE_TUN4_LENGTH                      equ 0001h
OSCTUNE_TUN4_MASK                        equ 0010h

// Register: PIE1
#define PIE1 PIE1
PIE1                                     equ 0F9Dh
// bitfield definitions
PIE1_TMR1IE_POSN                         equ 0000h
PIE1_TMR1IE_POSITION                     equ 0000h
PIE1_TMR1IE_SIZE                         equ 0001h
PIE1_TMR1IE_LENGTH                       equ 0001h
PIE1_TMR1IE_MASK                         equ 0001h
PIE1_CMP0IE_POSN                         equ 0001h
PIE1_CMP0IE_POSITION                     equ 0001h
PIE1_CMP0IE_SIZE                         equ 0001h
PIE1_CMP0IE_LENGTH                       equ 0001h
PIE1_CMP0IE_MASK                         equ 0002h
PIE1_CMP1IE_POSN                         equ 0002h
PIE1_CMP1IE_POSITION                     equ 0002h
PIE1_CMP1IE_SIZE                         equ 0001h
PIE1_CMP1IE_LENGTH                       equ 0001h
PIE1_CMP1IE_MASK                         equ 0004h
PIE1_CMP2IE_POSN                         equ 0003h
PIE1_CMP2IE_POSITION                     equ 0003h
PIE1_CMP2IE_SIZE                         equ 0001h
PIE1_CMP2IE_LENGTH                       equ 0001h
PIE1_CMP2IE_MASK                         equ 0008h
PIE1_TXIE_POSN                           equ 0004h
PIE1_TXIE_POSITION                       equ 0004h
PIE1_TXIE_SIZE                           equ 0001h
PIE1_TXIE_LENGTH                         equ 0001h
PIE1_TXIE_MASK                           equ 0010h
PIE1_RCIE_POSN                           equ 0005h
PIE1_RCIE_POSITION                       equ 0005h
PIE1_RCIE_SIZE                           equ 0001h
PIE1_RCIE_LENGTH                         equ 0001h
PIE1_RCIE_MASK                           equ 0020h
PIE1_ADIE_POSN                           equ 0006h
PIE1_ADIE_POSITION                       equ 0006h
PIE1_ADIE_SIZE                           equ 0001h
PIE1_ADIE_LENGTH                         equ 0001h
PIE1_ADIE_MASK                           equ 0040h
PIE1_TX1IE_POSN                          equ 0004h
PIE1_TX1IE_POSITION                      equ 0004h
PIE1_TX1IE_SIZE                          equ 0001h
PIE1_TX1IE_LENGTH                        equ 0001h
PIE1_TX1IE_MASK                          equ 0010h
PIE1_RC1IE_POSN                          equ 0005h
PIE1_RC1IE_POSITION                      equ 0005h
PIE1_RC1IE_SIZE                          equ 0001h
PIE1_RC1IE_LENGTH                        equ 0001h
PIE1_RC1IE_MASK                          equ 0020h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 0F9Eh
// bitfield definitions
PIR1_TMR1IF_POSN                         equ 0000h
PIR1_TMR1IF_POSITION                     equ 0000h
PIR1_TMR1IF_SIZE                         equ 0001h
PIR1_TMR1IF_LENGTH                       equ 0001h
PIR1_TMR1IF_MASK                         equ 0001h
PIR1_CMP0IF_POSN                         equ 0001h
PIR1_CMP0IF_POSITION                     equ 0001h
PIR1_CMP0IF_SIZE                         equ 0001h
PIR1_CMP0IF_LENGTH                       equ 0001h
PIR1_CMP0IF_MASK                         equ 0002h
PIR1_CMP1IF_POSN                         equ 0002h
PIR1_CMP1IF_POSITION                     equ 0002h
PIR1_CMP1IF_SIZE                         equ 0001h
PIR1_CMP1IF_LENGTH                       equ 0001h
PIR1_CMP1IF_MASK                         equ 0004h
PIR1_CMP2IF_POSN                         equ 0003h
PIR1_CMP2IF_POSITION                     equ 0003h
PIR1_CMP2IF_SIZE                         equ 0001h
PIR1_CMP2IF_LENGTH                       equ 0001h
PIR1_CMP2IF_MASK                         equ 0008h
PIR1_TXIF_POSN                           equ 0004h
PIR1_TXIF_POSITION                       equ 0004h
PIR1_TXIF_SIZE                           equ 0001h
PIR1_TXIF_LENGTH                         equ 0001h
PIR1_TXIF_MASK                           equ 0010h
PIR1_RCIF_POSN                           equ 0005h
PIR1_RCIF_POSITION                       equ 0005h
PIR1_RCIF_SIZE                           equ 0001h
PIR1_RCIF_LENGTH                         equ 0001h
PIR1_RCIF_MASK                           equ 0020h
PIR1_ADIF_POSN                           equ 0006h
PIR1_ADIF_POSITION                       equ 0006h
PIR1_ADIF_SIZE                           equ 0001h
PIR1_ADIF_LENGTH                         equ 0001h
PIR1_ADIF_MASK                           equ 0040h
PIR1_TX1IF_POSN                          equ 0004h
PIR1_TX1IF_POSITION                      equ 0004h
PIR1_TX1IF_SIZE                          equ 0001h
PIR1_TX1IF_LENGTH                        equ 0001h
PIR1_TX1IF_MASK                          equ 0010h
PIR1_RC1IF_POSN                          equ 0005h
PIR1_RC1IF_POSITION                      equ 0005h
PIR1_RC1IF_SIZE                          equ 0001h
PIR1_RC1IF_LENGTH                        equ 0001h
PIR1_RC1IF_MASK                          equ 0020h

// Register: IPR1
#define IPR1 IPR1
IPR1                                     equ 0F9Fh
// bitfield definitions
IPR1_TMR1IP_POSN                         equ 0000h
IPR1_TMR1IP_POSITION                     equ 0000h
IPR1_TMR1IP_SIZE                         equ 0001h
IPR1_TMR1IP_LENGTH                       equ 0001h
IPR1_TMR1IP_MASK                         equ 0001h
IPR1_CMP0IP_POSN                         equ 0001h
IPR1_CMP0IP_POSITION                     equ 0001h
IPR1_CMP0IP_SIZE                         equ 0001h
IPR1_CMP0IP_LENGTH                       equ 0001h
IPR1_CMP0IP_MASK                         equ 0002h
IPR1_CMP1IP_POSN                         equ 0002h
IPR1_CMP1IP_POSITION                     equ 0002h
IPR1_CMP1IP_SIZE                         equ 0001h
IPR1_CMP1IP_LENGTH                       equ 0001h
IPR1_CMP1IP_MASK                         equ 0004h
IPR1_CMP2IP_POSN                         equ 0003h
IPR1_CMP2IP_POSITION                     equ 0003h
IPR1_CMP2IP_SIZE                         equ 0001h
IPR1_CMP2IP_LENGTH                       equ 0001h
IPR1_CMP2IP_MASK                         equ 0008h
IPR1_TXIP_POSN                           equ 0004h
IPR1_TXIP_POSITION                       equ 0004h
IPR1_TXIP_SIZE                           equ 0001h
IPR1_TXIP_LENGTH                         equ 0001h
IPR1_TXIP_MASK                           equ 0010h
IPR1_RCIP_POSN                           equ 0005h
IPR1_RCIP_POSITION                       equ 0005h
IPR1_RCIP_SIZE                           equ 0001h
IPR1_RCIP_LENGTH                         equ 0001h
IPR1_RCIP_MASK                           equ 0020h
IPR1_ADIP_POSN                           equ 0006h
IPR1_ADIP_POSITION                       equ 0006h
IPR1_ADIP_SIZE                           equ 0001h
IPR1_ADIP_LENGTH                         equ 0001h
IPR1_ADIP_MASK                           equ 0040h
IPR1_TX1IP_POSN                          equ 0004h
IPR1_TX1IP_POSITION                      equ 0004h
IPR1_TX1IP_SIZE                          equ 0001h
IPR1_TX1IP_LENGTH                        equ 0001h
IPR1_TX1IP_MASK                          equ 0010h
IPR1_RC1IP_POSN                          equ 0005h
IPR1_RC1IP_POSITION                      equ 0005h
IPR1_RC1IP_SIZE                          equ 0001h
IPR1_RC1IP_LENGTH                        equ 0001h
IPR1_RC1IP_MASK                          equ 0020h

// Register: PIE2
#define PIE2 PIE2
PIE2                                     equ 0FA0h
// bitfield definitions
PIE2_LVDIE_POSN                          equ 0002h
PIE2_LVDIE_POSITION                      equ 0002h
PIE2_LVDIE_SIZE                          equ 0001h
PIE2_LVDIE_LENGTH                        equ 0001h
PIE2_LVDIE_MASK                          equ 0004h
PIE2_EEIE_POSN                           equ 0004h
PIE2_EEIE_POSITION                       equ 0004h
PIE2_EEIE_SIZE                           equ 0001h
PIE2_EEIE_LENGTH                         equ 0001h
PIE2_EEIE_MASK                           equ 0010h
PIE2_OSCFIE_POSN                         equ 0007h
PIE2_OSCFIE_POSITION                     equ 0007h
PIE2_OSCFIE_SIZE                         equ 0001h
PIE2_OSCFIE_LENGTH                       equ 0001h
PIE2_OSCFIE_MASK                         equ 0080h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 0FA1h
// bitfield definitions
PIR2_LVDIF_POSN                          equ 0002h
PIR2_LVDIF_POSITION                      equ 0002h
PIR2_LVDIF_SIZE                          equ 0001h
PIR2_LVDIF_LENGTH                        equ 0001h
PIR2_LVDIF_MASK                          equ 0004h
PIR2_EEIF_POSN                           equ 0004h
PIR2_EEIF_POSITION                       equ 0004h
PIR2_EEIF_SIZE                           equ 0001h
PIR2_EEIF_LENGTH                         equ 0001h
PIR2_EEIF_MASK                           equ 0010h
PIR2_OSCFIF_POSN                         equ 0007h
PIR2_OSCFIF_POSITION                     equ 0007h
PIR2_OSCFIF_SIZE                         equ 0001h
PIR2_OSCFIF_LENGTH                       equ 0001h
PIR2_OSCFIF_MASK                         equ 0080h

// Register: IPR2
#define IPR2 IPR2
IPR2                                     equ 0FA2h
// bitfield definitions
IPR2_LVDIP_POSN                          equ 0002h
IPR2_LVDIP_POSITION                      equ 0002h
IPR2_LVDIP_SIZE                          equ 0001h
IPR2_LVDIP_LENGTH                        equ 0001h
IPR2_LVDIP_MASK                          equ 0004h
IPR2_EEIP_POSN                           equ 0004h
IPR2_EEIP_POSITION                       equ 0004h
IPR2_EEIP_SIZE                           equ 0001h
IPR2_EEIP_LENGTH                         equ 0001h
IPR2_EEIP_MASK                           equ 0010h
IPR2_OSCFIP_POSN                         equ 0007h
IPR2_OSCFIP_POSITION                     equ 0007h
IPR2_OSCFIP_SIZE                         equ 0001h
IPR2_OSCFIP_LENGTH                       equ 0001h
IPR2_OSCFIP_MASK                         equ 0080h

// Register: PIE3
#define PIE3 PIE3
PIE3                                     equ 0FA3h
// bitfield definitions
PIE3_PTIE_POSN                           equ 0004h
PIE3_PTIE_POSITION                       equ 0004h
PIE3_PTIE_SIZE                           equ 0001h
PIE3_PTIE_LENGTH                         equ 0001h
PIE3_PTIE_MASK                           equ 0010h
PIE3_TXB2IE_POSN                         equ 0004h
PIE3_TXB2IE_POSITION                     equ 0004h
PIE3_TXB2IE_SIZE                         equ 0001h
PIE3_TXB2IE_LENGTH                       equ 0001h
PIE3_TXB2IE_MASK                         equ 0010h
PIE3_TXBNIE_POSN                         equ 0004h
PIE3_TXBNIE_POSITION                     equ 0004h
PIE3_TXBNIE_SIZE                         equ 0001h
PIE3_TXBNIE_LENGTH                       equ 0001h
PIE3_TXBNIE_MASK                         equ 0010h

// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 0FA4h
// bitfield definitions
PIR3_PTIF_POSN                           equ 0004h
PIR3_PTIF_POSITION                       equ 0004h
PIR3_PTIF_SIZE                           equ 0001h
PIR3_PTIF_LENGTH                         equ 0001h
PIR3_PTIF_MASK                           equ 0010h
PIR3_TXBNIF_POSN                         equ 0004h
PIR3_TXBNIF_POSITION                     equ 0004h
PIR3_TXBNIF_SIZE                         equ 0001h
PIR3_TXBNIF_LENGTH                       equ 0001h
PIR3_TXBNIF_MASK                         equ 0010h

// Register: IPR3
#define IPR3 IPR3
IPR3                                     equ 0FA5h
// bitfield definitions
IPR3_PTIP_POSN                           equ 0004h
IPR3_PTIP_POSITION                       equ 0004h
IPR3_PTIP_SIZE                           equ 0001h
IPR3_PTIP_LENGTH                         equ 0001h
IPR3_PTIP_MASK                           equ 0010h
IPR3_TXBNIP_POSN                         equ 0004h
IPR3_TXBNIP_POSITION                     equ 0004h
IPR3_TXBNIP_SIZE                         equ 0001h
IPR3_TXBNIP_LENGTH                       equ 0001h
IPR3_TXBNIP_MASK                         equ 0010h

// Register: EECON1
#define EECON1 EECON1
EECON1                                   equ 0FA6h
// bitfield definitions
EECON1_RD_POSN                           equ 0000h
EECON1_RD_POSITION                       equ 0000h
EECON1_RD_SIZE                           equ 0001h
EECON1_RD_LENGTH                         equ 0001h
EECON1_RD_MASK                           equ 0001h
EECON1_WR_POSN                           equ 0001h
EECON1_WR_POSITION                       equ 0001h
EECON1_WR_SIZE                           equ 0001h
EECON1_WR_LENGTH                         equ 0001h
EECON1_WR_MASK                           equ 0002h
EECON1_WREN_POSN                         equ 0002h
EECON1_WREN_POSITION                     equ 0002h
EECON1_WREN_SIZE                         equ 0001h
EECON1_WREN_LENGTH                       equ 0001h
EECON1_WREN_MASK                         equ 0004h
EECON1_WRERR_POSN                        equ 0003h
EECON1_WRERR_POSITION                    equ 0003h
EECON1_WRERR_SIZE                        equ 0001h
EECON1_WRERR_LENGTH                      equ 0001h
EECON1_WRERR_MASK                        equ 0008h
EECON1_FREE_POSN                         equ 0004h
EECON1_FREE_POSITION                     equ 0004h
EECON1_FREE_SIZE                         equ 0001h
EECON1_FREE_LENGTH                       equ 0001h
EECON1_FREE_MASK                         equ 0010h
EECON1_CFGS_POSN                         equ 0006h
EECON1_CFGS_POSITION                     equ 0006h
EECON1_CFGS_SIZE                         equ 0001h
EECON1_CFGS_LENGTH                       equ 0001h
EECON1_CFGS_MASK                         equ 0040h
EECON1_EEPGD_POSN                        equ 0007h
EECON1_EEPGD_POSITION                    equ 0007h
EECON1_EEPGD_SIZE                        equ 0001h
EECON1_EEPGD_LENGTH                      equ 0001h
EECON1_EEPGD_MASK                        equ 0080h
EECON1_EEFS_POSN                         equ 0006h
EECON1_EEFS_POSITION                     equ 0006h
EECON1_EEFS_SIZE                         equ 0001h
EECON1_EEFS_LENGTH                       equ 0001h
EECON1_EEFS_MASK                         equ 0040h

// Register: EECON2
#define EECON2 EECON2
EECON2                                   equ 0FA7h

// Register: EEDATA
#define EEDATA EEDATA
EEDATA                                   equ 0FA8h

// Register: EEADR
#define EEADR EEADR
EEADR                                    equ 0FA9h

